from pyecharts import Line, Bar, Pie, EffectScatter


#积分
x = ["巴塞罗那", "马竞", "皇马","赫塔菲", "阿拉维斯", "塞维利亚","贝蒂斯","皇家社会",'西班牙人',"埃瓦尔"]
#进球
x1 = ["巴塞罗那",  "皇马", "塞维利亚","马竞", "莱万特", "塞尔塔","赫塔菲","埃瓦尔","西班牙人","贝蒂斯"]
#失球
x2 = ["莱万特",  "巴列卡诺", "塞尔塔","韦斯卡", "埃瓦尔","西班牙人", "黄潜","塞维利亚","赫罗纳","瓦拉多"]
#领跑
x3 = ['巴塞罗那','塞维利亚','皇家马德里']
x4 = ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26']
o = [69.2,57.7,57.7,42.3,42.3,38.5,38.5,34.6,34.6,30.8]
o1 = [66,43,41,38,37,36,34,34,31,30]
o2 = [46,45,44,42,39,35,35,34,34,34]
o3 = [22,3,1]
#皇马排名,积分

o4 = [4,1,2,2,2,2,2,4,7,9,6,6,6,5,4,4,4,5,4,3,3,3,2,3,3,3]
o5 = [0,3,6,9,10,13,13,14,14,14,14,17,20,20,23,26,29,30,30,33,36,39,42,45,45,48,48]
o6 = []
for i in range(0,26):
	o6.append(o5[i+1]-o5[i])
# bar = Bar("联赛胜率排行top10")
# bar.add('胜率%',x,o,is_label_show=True)
# bar.render('bar01.html')
#
# bar = Bar("联赛进球排行top10")
# bar.add('进球',x1,o1,is_label_show=True)
# bar.render('bar02.html')
#
# bar = Bar("联赛失球排行top10")
# bar.add('失球',x2,o2,is_label_show=True)
# bar.render('bar03.html')

# line = Line("皇马战绩和球队人事调整")
# line.add('排名',x4,o4,is_label_show=True)
# # line.add('失球',x4,o5,is_label_show=True,color='#a3aed5')
#
# line.render('line04.html')

line = Line("皇马战绩和球队人事调整")
line.add('积分增长率',x4,o6,is_label_show=True)
# line.add('失球',x4,o5,is_label_show=True,color='#a3aed5')

line.render('line05.html')